EDT/УТ/src/Documents/РасчетМотивацииЭкипажей/РасчетМотивацииЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетМотивацииЭкипажей</name>
  <registerRecords>AccumulationRegister.СводПоЗарплате</registerRecords>
  <registerRecords>AccumulationRegister.РасчетМотивацииЭкипажей</registerRecords>
  <attributes>
    <name>МесяцРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиНУ</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяНУ</name>
      <type>
        <types>CatalogRef.НачисленияУдержанияЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Выполняемость</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>УчастникЭкипажа</name>
      <type>
        <types>EnumRef.УчастникЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЗаказов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказовНеВыполнено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказовВыполнено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетнаяБаза</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКНачислению</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>УчастникЭкипажа</name>
      <type>
        <types>EnumRef.УчастникЭкипажа</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяНУ</name>
      <type>
        <types>CatalogRef.НачисленияУдержанияЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНУ</name>
      <type>
        <types>EnumRef.ТипыНУЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчета</name>
      <type>
        <types>EnumRef.ВариантыРасчетаНУЭкипажей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазаДляРасчета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/РасчетМотивацииЭкипажей/РасчетМотивацииЭкипажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетМотивацииЭкипажей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипРасчета</name>
    <type>
      <types>EnumRef.ВариантыРасчетаНУЭкипажей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаДляРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяНУ</name>
    <type>
      <types>CatalogRef.НачисленияУдержанияЭкипажей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНУ</name>
    <type>
      <types>EnumRef.ТипыНУЭкипажей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/AccumulationRegisters/СводПоЗарплате/СводПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СводПоЗарплате</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетаЗарплаты</name>
    <type>
      <types>EnumRef.ТипыРасчетаЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНУ</name>
    <type>
      <types>EnumRef.ТипыНУЭкипажей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ТипыРасчетаЗарплаты/ТипыРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетаЗарплаты</name>
  <enumValues>
    <name>СдельныйРасчетПоДоставкам</name>
  </enumValues>
  <enumValues>
    <name>РасчетПоОкладу</name>
  </enumValues>
  <enumValues>
    <name>НочныеСмены</name>
  </enumValues>
  <enumValues>
    <name>Магистраль</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/РасчетМотивацииЭкипажей/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    ДвиженияРасчетМотивацииЭкипажей();
    ДвиженияСводПоЗарплате();
КонецПроцедуры


Процедура ДвиженияРасчетМотивацииЭкипажей()
    Движения.РасчетМотивацииЭкипажей.БлокироватьДляИзменения = Истина;
    Движения.РасчетМотивацииЭкипажей.Записать();
    
    Для Каждого ТекСтрокаНачисленияУдержания Из НачисленияУдержания Цикл
        Если ТекСтрокаНачисленияУдержания.Результат <> 0 Тогда
            Движение = Движения.РасчетМотивацииЭкипажей.Добавить();
            Движение.Период = МесяцРасчета;
            Движение.ФизЛицо = ТекСтрокаНачисленияУдержания.ФизЛицо;
            Движение.УчастникЭкипажа = ТекСтрокаНачисленияУдержания.УчастникЭкипажа;
            Движение.СтатьяНУ = ТекСтрокаНачисленияУдержания.СтатьяНУ;
            Движение.ТипНУ = ТекСтрокаНачисленияУдержания.ТипНУ;
            Движение.Результат = ТекСтрокаНачисленияУдержания.Результат;
            Движение.ТипРасчета = ТекСтрокаНачисленияУдержания.ТипРасчета;
            Движение.ПоказательРасчета = ТекСтрокаНачисленияУдержания.ПоказательРасчета;
            Движение.БазаДляРасчета = ТекСтрокаНачисленияУдержания.БазаДляРасчета;
        КонецЕсли;
    КонецЦикла;
    
    Движения.РасчетМотивацииЭкипажей.БлокироватьДляИзменения = Истина;
    Движения.РасчетМотивацииЭкипажей.Записать();
    
КонецПроцедуры


Процедура ДвиженияСводПоЗарплате()
    Движения.СводПоЗарплате.БлокироватьДляИзменения = Истина;
    Движения.СводПоЗарплате.Записать();
    
    //ВТ_ТаблицаДвижений = НачисленияУдержания.Выгрузить();
    //ВТ_ТаблицаДвижений.Свернуть("ФизЛицо,УчастникЭкипажа,ТипНУ","Результат");
    
    Для Каждого ТекСтрока Из НачисленияУдержания Цикл
        Если ТекСтрока.Результат <> 0 Тогда
            Движение = Движения.СводПоЗарплате.Добавить();
            Движение.Период = МесяцРасчета;
            Движение.ЮрЛицо = Справочники.Организации.ПустаяСсылка();
            Движение.ТипРасчетаЗарплаты = Перечисления.ТипыРасчетаЗарплаты.СдельныйРасчетПоДоставкам;
            Движение.УчастникЭкипажа = ТекСтрока.УчастникЭкипажа;
            Движение.ФизЛицо = ТекСтрока.ФизЛицо;
            Движение.ТипНУ = ТекСтрока.ТипНУ;
            Движение.Сумма = ТекСтрока.Результат;
            Движение.ПоказательКоличества = 1;
        КонецЕсли;
    КонецЦикла;
    
    Движения.СводПоЗарплате.БлокироватьДляИзменения = Истина;
    Движения.СводПоЗарплате.Записать();
    
КонецПроцедуры
